export default {
  nav: {
    home: "होम",
    login: "लॉगिन",
    logout: "लॉगआउट",
    editor: "एडिटर",
    abtesting: "",
    player: "",
    404: "एरर",
  },
  editor: {
    video_input: {
      placeholder: "यूट्यूब वीडियो का लिंक यहाँ लिखें",
      title: "यूट्यूब वीडियो का लिंक",
    },
    plio_title: {
      placeholder: "प्लायो का नाम यहाँ लिखें ",
      title: "प्लायो का नाम",
    },
  },
  home: {
    plio_list_heading: "सारे प्लायो",
    plio_thumbnail: {
      created: "कब बना",
      id: "पहचान",
    },
  },
  login: {
    learner: {
      phone_prompt: "कृपया अपना मोबाइल नंबर डालें (केवल दस अंक)",
      button: "प्लायो दिखाओ",
    },
  },
  player: {
    start: "शुरू करें",
    question: {
      submit: "सबमिट करें",
      revise: "पुनः देखें",
      proceed: "आगे बढ़ें",
    },
    tutorial: {
      mcq: "कोई एक चुने",
    },
  },
  error: {
    404: "आपसे गलत लिंक कॉपी हो गया है | आप वापस जाकर सही लिंक यहाँ कॉपी करके पेस्ट करिए | सहायता के लिए अपने टीचर से बात करें",
    tutorial: "प्लायो कैसे इस्तेमाल करना है वह जानने के लिए यह वीडियो देखें",
    browser: {
      heading: "प्लायो सिर्फ गूगल क्रोम पर चलता है",
      download: "ऊपर क्लिक करके गूगल क्रोम डाउनलोड करें",
      copy: "प्लायो लिंक कॉपी करके गूगल क्रोम में खोलें",
      watch_video: "ऊपर दिया गया वीडियो देखें",
      failsafe: "और उसके बाद गूगल फॉर्म के लिंक पे जाके प्रश्न करें",
    },
  },
  generic: {
    or: "या फिर",
  },
};
